Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/posts/*",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyUnencryptedObjectUploads"

          + condition {
              + test     = "StringNotEquals"
              + values   = [
                  + "AES256",
                ]
              + variable = "s3:x-amz-server-side-encryption"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:DeleteObjectTagging",
              + "s3:PutObject",
              + "s3:PutObjectTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyIfNotFromOurOrg"

          + condition {
              + test     = "ArnNotEqualsIfExists"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }
          + condition {
              + test     = "StringNotEqualsIfExists"
              + values   = [
                  + "o-4uer5s3xlw",
                ]
              + variable = "aws:PrincipalOrgID"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          ~ forwarded_values {
              ~ query_string            = false -> true
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_cloudtrail.media_trail will be updated in-place
~ resource "aws_cloudtrail" "media_trail" {
        id                            = "arn:aws:cloudtrail:us-east-2:390402544450:trail/wutopia-media-trail"
        name                          = "wutopia-media-trail"
        tags                          = {}
        # (16 unchanged attributes hidden)

      ~ advanced_event_selector {
            name = "S3WriteEventsForMedia"

          - field_selector {
              - ends_with       = [] -> null
              - equals          = [] -> null
              - field           = "resources.ARN" -> null
              - not_ends_with   = [] -> null
              - not_equals      = [] -> null
              - not_starts_with = [] -> null
              - starts_with     = [
                  - "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/",
                ] -> null
            }
          + field_selector {
              + ends_with       = []
              + equals          = []
              + field           = "resources.ARN"
              + not_ends_with   = []
              + not_equals      = []
              + not_starts_with = []
              + starts_with     = [
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/uploads/",
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/profiles/",
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/profiles/",
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/images/",
                  + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/images/",
                ]
            }

            # (3 unchanged blocks hidden)
        }
    }

  # aws_cloudwatch_event_rule.s3_raw_puts will be updated in-place
~ resource "aws_cloudwatch_event_rule" "s3_raw_puts" {
      ~ description         = "S3 Object Created events for prod-wrestleutopia-media-bucket with key prefix raw/" -> "S3 Object Created events for prod-wrestleutopia-media-bucket with key prefix raw/uploads/"
      ~ event_pattern       = jsonencode(
          ~ {
              ~ detail      = {
                  ~ object = {
                      ~ key = [
                          ~ {
                              ~ prefix = "raw/" -> "raw/uploads/"
                            },
                        ]
                    }
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id                  = "wutopia-s3-raw-puts"
        name                = "wutopia-s3-raw-puts"
        tags                = {}
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.imgproc will be updated in-place
~ resource "aws_cloudwatch_event_target" "imgproc" {
        id             = "wutopia-s3-raw-puts-lambda-imgproc"
        # (9 unchanged attributes hidden)

      + dead_letter_config {
          + arn = (known after apply)
        }

      + retry_policy {
          + maximum_event_age_in_seconds = 3600
          + maximum_retry_attempts       = 5
        }
    }

  # aws_cloudwatch_log_group.lambda_api will be created
+ resource "aws_cloudwatch_log_group" "lambda_api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/wrestleutopia-api"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_log_group.lambda_imgproc will be created
+ resource "aws_cloudwatch_log_group" "lambda_imgproc" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/wrestleutopia-image-processor"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_policy.api_s3_media_policy must be replaced
-/+ resource "aws_iam_policy" "api_s3_media_policy" {
      ~ arn              = "arn:aws:iam::390402544450:policy/wrestleutopia-api-s3-media" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Allow API Lambda limited S3 access under user/* prefix" -> "Allow API Lambda read (and optional delete) on public assets" # forces replacement
      ~ id               = "arn:aws:iam::390402544450:policy/wrestleutopia-api-s3-media" -> (known after apply)
        name             = "wrestleutopia-api-s3-media"
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      ~ Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/user/*" -> [
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/*",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/*",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/posts/*",
                        ]
                      ~ Sid      = "UserPrefixRW" -> "ReadPublic"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/*",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/*",
                        ]
                      + Sid      = "OptionalDeletePublic"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ policy_id        = "ANPAVVZOOCNBDYC3FRYIE" -> (known after apply)
      - tags             = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.image_processor_policy must be replaced
-/+ resource "aws_iam_policy" "image_processor_policy" {
      ~ arn              = "arn:aws:iam::390402544450:policy/wrestleutopia-image-processor" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Image processor: read raw/*, write images/*, update media item in DynamoDB" -> "Image processor: read raw/uploads/*, write public images, update media item in DynamoDB" # forces replacement
      ~ id               = "arn:aws:iam::390402544450:policy/wrestleutopia-image-processor" -> (known after apply)
        name             = "wrestleutopia-image-processor"
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/*" -> "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/uploads/*"
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/images/*" -> [
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/images/*",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/images/*",
                        ]
                      ~ Sid      = "S3WriteImages" -> "S3WritePublicImages"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:GetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:us-east-2:390402544450:table/wrestleutopia-Tryouts"
                        Sid      = "DynamoUpdateMedia"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ policy_id        = "ANPAVVZOOCNBN2226ST4I" -> (known after apply)
      - tags             = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.presign_s3_policy will be updated in-place
~ resource "aws_iam_policy" "presign_s3_policy" {
        id               = "arn:aws:iam::390402544450:policy/wrestleutopia-presign-s3"
        name             = "wrestleutopia-presign-s3"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/user/*" -> "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/uploads/*"
                      ~ Sid      = "AllowPutOnUserPrefix" -> "AllowPutOnRawPrefix"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action    = [
                            # (1 unchanged element hidden)
                            "s3:GetObject",
                          + "s3:AbortMultipartUpload",
                          + "s3:PutObjectTagging",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      ~ Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/raw/*" -> [
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/wrestlers/profiles/*",
                          + "arn:aws:s3:::prod-wrestleutopia-media-bucket/public/promoters/profiles/*",
                        ]
                      ~ Sid       = "AllowPutOnRawPrefix" -> "AllowPutOnPublicProfiles"
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - Action    = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:AbortMultipartUpload",
                          - "s3:PutObjectTagging",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/profiles/*"
                      - Sid       = "AllowPutOnProfilesPrefix"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.api_s3_media_attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "api_s3_media_attach" {
      ~ id         = "wrestleutopia-api-role/arn:aws:iam::390402544450:policy/wrestleutopia-api-s3-media" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::390402544450:policy/wrestleutopia-api-s3-media" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.image_processor_attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "image_processor_attach" {
      ~ id         = "wrestleutopia-image-processor-role/arn:aws:iam::390402544450:policy/wrestleutopia-image-processor" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::390402544450:policy/wrestleutopia-image-processor" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.api will be updated in-place
~ resource "aws_lambda_function" "api" {
        id                             = "wrestleutopia-api"
      ~ last_modified                  = "2025-09-25T23:00:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "nVTTHyImAI9m8g2sg8Wfw7Hz+EVybvDxkNjDCcl0SxU=" -> "0pwov+g9j7LI72BAwFbQZJEWYOGvZHlBCARb4cnynx0="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.image_processor will be updated in-place
~ resource "aws_lambda_function" "image_processor" {
        id                             = "wrestleutopia-image-processor"
      ~ last_modified                  = "2025-09-30T20:25:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "nL2O/U14mS/XjUbffUsKU9c0x5LmLw1v7gTiYy+906c=" -> "8UYuESduDk0Qccbz91yspR+BhD2A8wAs2HaD5tzoqSQ="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.presign will be updated in-place
~ resource "aws_lambda_function" "presign" {
        id                             = "wrestleutopia-presign"
      ~ last_modified                  = "2025-10-01T00:00:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "RmeyG4SRFjHLOrewZKBg17WC2GpVh7pEKinEAvYdKfA=" -> "3nPndc4eEVmCjn5Vv26CLavIxmlpM1K00VFYFzcZqTs="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_url will be updated in-place
~ resource "aws_lambda_function" "upload_url" {
        id                             = "wrestleutopia-upload-url"
      ~ last_modified                  = "2025-09-24T03:37:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "KPRriKlwNS1nKDWFrhbIlTvb+KmYnD52UOCqmYWAMfw=" -> "ofZpOypq/mFKD2u0AiSfT5JXFoAR7iLRJbylHdmZbGs="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be updated in-place
~ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
        id                                     = "prod-wrestleutopia-media-bucket"
        # (4 unchanged attributes hidden)

      ~ rule {
          ~ id     = "gallery_intelligent_tiering" -> "raw_uploads_expire_7d"
            # (2 unchanged attributes hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          ~ filter {
              ~ prefix = "gallery/" -> "raw/uploads/"
            }

          ~ noncurrent_version_expiration {
              ~ noncurrent_days = 30 -> 7
            }

          - transition {
              - days          = 0 -> null
              - storage_class = "INTELLIGENT_TIERING" -> null
            }
        }
      + rule {
          + id     = "public_wrestlers_images_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/wrestlers/images/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + rule {
          + id     = "public_promoters_images_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/promoters/images/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + rule {
          + id     = "public_wrestlers_gallery_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/wrestlers/gallery/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + rule {
          + id     = "public_promoters_gallery_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/promoters/gallery/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + rule {
          + id     = "public_wrestlers_highlights_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/wrestlers/highlights/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }
      + rule {
          + id     = "public_promoters_highlights_tiering"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "public/promoters/highlights/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + transition {
              + days          = 0
              + storage_class = "INTELLIGENT_TIERING"
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyUnencryptedObjectUploads"
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectTagging",
                          - "s3:PutObject",
                          - "s3:DeleteObjectTagging",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Condition = {
                          - ArnNotEqualsIfExists    = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                          - StringNotEqualsIfExists = {
                              - "aws:PrincipalOrgID" = "o-4uer5s3xlw"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyIfNotFromOurOrg"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue.imgproc_dlq will be created
+ resource "aws_sqs_queue" "imgproc_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "wrestleutopia-imgproc-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-east-2"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 7 to add, 11 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 7 to add, 11 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```